OpenFOAM/4.x/backwardFacingStepKasagi.done/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          16;
        startFace       6112;
    }
    outlet
    {
        type            patch;
        nFaces          24;
        startFace       6128;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          144;
        startFace       6152;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          136;
        startFace       6296;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          6272;
        startFace       6432;
    }
)

// ************************************************************************* //
