OpenFOAM/4.x/backwardFacingStepKasagi.done/Allrun.pre
#!/bin/sh

blockMesh > log.blockMesh 2>&1
postProcess -func 'patchAverage(name=inlet,U)' > log.Ubulk

