OpenFOAM/4.x/backwardFacingStepKasagi.done/Allrun.solve
#!/bin/sh

simpleFoam > log 2>&1


